import React from "react";
import AnswersItem from "./components/AnswersItem";

import img from "/img/answers.png";

function Answers() {
  return (
    <div
      className="container flex lg:flex-row flex-col-reverse mt-20"
      id="Answers"
    >
      <div className="answers border-custom border-l-0 w-full lg:w-[60%]">
        <h2 className="py-10 px-6">Відповіді на запитання</h2>

        <AnswersItem
          title="Скільки часу триває навчання та скільки потрібно виділяти на уроки?"
          ditails="Навчання триває 4 тижні на першому тарифі та 5 тижнів на другому та третьому тарифах (бо є додатковий модуль “Методологія”). На навчання треба виділяти від 2 до 4 години на тиждень на тарифі без зворотного зв'язку. І від 3 до 6 годин на тарифі із зворотним зв'язком."
        />
        <AnswersItem
          title="Хочу розбити суму на кілька платежів. Як це зробити?"
          ditails="Навчання триває 4 тижні на першому тарифі та 5 тижнів на другому та третьому тарифах (бо є додатковий модуль “Методологія”). На навчання треба виділяти від 2 до 4 години на тиждень на тарифі без зворотного зв'язку. І від 3 до 6 годин на тарифі із зворотним зв'язком."
        />
        <AnswersItem
          title="Коли початок навчання?"
          ditails="Навчання триває 4 тижні на першому тарифі та 5 тижнів на другому та третьому тарифах (бо є додатковий модуль “Методологія”). На навчання треба виділяти від 2 до 4 години на тиждень на тарифі без зворотного зв'язку. І від 3 до 6 годин на тарифі із зворотним зв'язком."
        />
        <AnswersItem
          title="Я сплатив/ла, що має статися далі?"
          ditails="Навчання триває 4 тижні на першому тарифі та 5 тижнів на другому та третьому тарифах (бо є додатковий модуль “Методологія”). На навчання треба виділяти від 2 до 4 години на тиждень на тарифі без зворотного зв'язку. І від 3 до 6 годин на тарифі із зворотним зв'язком."
        />
        <AnswersItem
          title="А якщо я не хочу запускати онлайн-курс, то мені підійде?"
          ditails="Навчання триває 4 тижні на першому тарифі та 5 тижнів на другому та третьому тарифах (бо є додатковий модуль “Методологія”). На навчання треба виділяти від 2 до 4 години на тиждень на тарифі без зворотного зв'язку. І від 3 до 6 годин на тарифі із зворотним зв'язком."
        />
      </div>

      <div className="flex justify-center items-center p-0 lg:p-6 lg:w-[40%]  xzsborder-l-0">
        <img src={img} alt="plitkarka katia" className="w-full" />
      </div>
    </div>
  );
}

export default Answers;
